Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/motor.c
/************************************************************************************
 * configs/coordinator/motor.c
 *
 *   Copyright (C) 2019 Uros Platise. All rights reserved.
 *   Author: Akrapong Patchararungruang (akrapong.p@ku.th)
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/fs/fs.h>

#include <sys/types.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>

#include "chip.h"
#include "up_internal.h"
#include "up_arch.h"
#include "stm32_gpio.h"
#include "stm32_pfm.h"
#include <arch/board/motor.h>

/************************************************************************************
 * Private Types
 ************************************************************************************/

/* Motor configuration structure */
struct motor_cfg_s
{
  uint32_t  motor_id;     /* PFM id of this motor */
  uint32_t  dir_pin;      /* Motor direction pin */
  uint32_t  srv_on_pin;   /* Motor enable pin */
  uint32_t  alrm_res_pin; /* Alarm reset pin */
  uint32_t  dev_clr_pin;  /* Counter-deviation clear pin */
  uint32_t  alrm_pin;     /* Motor alarm input pin */
  uint32_t  cmplt_pin;    /* Command complete input pin */
  uint32_t  led_red;      /* Red LED control pin */
  uint32_t  led_green;    /* Green LED control pin */
};

struct motor_priv_s
{
  FAR struct motor_cfg_s      *cfg;
  FAR struct stm32_pfm_dev_s  *pfm;
  volatile int32_t            step_count;
  volatile motor_state_t      state;
  volatile bool               is_cw;  /* Is negative direction? */
  volatile bool               is_start; /* The motor has been started without any stop command */
};

/************************************************************************************
 * Private Data
 ************************************************************************************/

struct motor_cfg_s motor_cfg[6] = 
{

{
  .motor_id     = 0,
  .dir_pin      = GPIO_MTR1_DIRECTION,
  .srv_on_pin   = GPIO_MTR1_SVON,
  .alrm_res_pin = GPIO_MTR1_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR1_DEV_CLR,
  .alrm_pin     = GPIO_MTR1_ALRM,
  .cmplt_pin    = GPIO_MTR1_CMPLT,
  .led_red      = GPIO_MTR1_LED_RED,
  .led_green    = GPIO_MTR1_LED_GRN
},

{
  .motor_id     = 1,
  .dir_pin      = GPIO_MTR2_DIRECTION,
  .srv_on_pin   = GPIO_MTR2_SVON,
  .alrm_res_pin = GPIO_MTR2_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR2_DEV_CLR,
  .alrm_pin     = GPIO_MTR2_ALRM,
  .cmplt_pin    = GPIO_MTR2_CMPLT,
  .led_red      = GPIO_MTR2_LED_RED,
  .led_green    = GPIO_MTR2_LED_GRN
},

{
  .motor_id     = 2,
  .dir_pin      = GPIO_MTR3_DIRECTION,
  .srv_on_pin   = GPIO_MTR3_SVON,
  .alrm_res_pin = GPIO_MTR3_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR3_DEV_CLR,
  .alrm_pin     = GPIO_MTR3_ALRM,
  .cmplt_pin    = GPIO_MTR3_CMPLT,
  .led_red      = GPIO_MTR3_LED_RED,
  .led_green    = GPIO_MTR3_LED_GRN
},

{
  .motor_id     = 3,
  .dir_pin      = GPIO_MTR4_DIRECTION,
  .srv_on_pin   = GPIO_MTR4_SVON,
  .alrm_res_pin = GPIO_MTR4_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR4_DEV_CLR,
  .alrm_pin     = GPIO_MTR4_ALRM,
  .cmplt_pin    = GPIO_MTR4_CMPLT,
  .led_red      = GPIO_MTR4_LED_RED,
  .led_green    = GPIO_MTR4_LED_GRN
},

{
  .motor_id     = 4,
  .dir_pin      = GPIO_MTR5_DIRECTION,
  .srv_on_pin   = GPIO_MTR5_SVON,
  .alrm_res_pin = GPIO_MTR5_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR5_DEV_CLR,
  .alrm_pin     = GPIO_MTR5_ALRM,
  .cmplt_pin    = GPIO_MTR5_CMPLT,
  .led_red      = GPIO_MTR5_LED_RED,
  .led_green    = GPIO_MTR5_LED_GRN
},

{
  .motor_id     = 5,
  .dir_pin      = GPIO_MTR6_DIRECTION,
  .srv_on_pin   = GPIO_MTR6_SVON,
  .alrm_res_pin = GPIO_MTR6_ALRM_RES,
  .dev_clr_pin  = GPIO_MTR6_DEV_CLR,
  .alrm_pin     = GPIO_MTR6_ALRM,
  .cmplt_pin    = GPIO_MTR6_CMPLT,
  .led_red      = GPIO_MTR6_LED_RED,
  .led_green    = GPIO_MTR6_LED_GRN
}

};

struct motor_priv_s motor_priv[6] =
{

{
  .cfg    = &(motor_cfg[0]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[1]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[2]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[3]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[4]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
},

{
  .cfg    = &(motor_cfg[5]),
  .pfm    = NULL,
  .step_count = 0L,
  .is_cw  = false,
  .is_start = false,
  .state  = MOTOR_UNINIT
}

