Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/motor.c
  //motor_servo_on(priv->cfg);
  motor_led_green_on(priv->cfg);
  motor_led_red_off(priv->cfg);

  flags = enter_critical_section();
  priv->state = MOTOR_READY;
  leave_critical_section(flags);

  return OK;
}

/* Other basic functions */


/************************************************************************************
 * Name: motor_emergency
 *
 * Description:
 *   Service routine to handle change from Emergency button.
 *
 ************************************************************************************/
static int motor_emergency(int irq, FAR void *context, FAR void *arg)
{
  int i;

  UNUSED(irq);
  UNUSED(context);
  UNUSED(arg);

  if(motor_emergency_stat())
  {
    _alert("EMERGENCY ASSERT!!!\n");
    /* Emergency button armed. Stop all motor and turn on all LEDs */
    for(i = 0;i < 6;i++)
    {
      motor_enter_unavailable(&(motor_priv[i]));
    }
  }
  else
  {
    _info("Emergency released\n");
    /* Emergency button unarmed. Release all unavailable motor */
    for(i = 0;i < 6;i++)
    {
      if(motor_priv[i].state == MOTOR_UNAVAILABLE)
      {
        motor_enter_uninit(&(motor_priv[i]));
      }
    }
  }
  return OK;
}

/************************************************************************************
 * Name: motor_alarm
 *
 * Description:
 *   Service routine to handle motor alarm signal.
 *     arg : pointer to the particular motor structure.
 *
 ************************************************************************************/
static int motor_alarm(int irq, FAR void *context, FAR void *arg)
{
  FAR struct motor_priv_s* priv = (FAR struct motor_priv_s*)arg;

  UNUSED(irq);
  UNUSED(context);

  if(motor_alarm_stat(priv->cfg))
    return(motor_enter_alarm(priv));
  else
    return(OK);
}

/************************************************************************************
 * Driver interface
 ************************************************************************************/

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int     motor_open(FAR struct file *filep);
static int     motor_close(FAR struct file *filep);
static ssize_t motor_read(FAR struct file *filep, FAR char *buffer, size_t buflen);
static ssize_t motor_write(FAR struct file *filep, FAR const char *buffer, size_t buflen);
static int     motor_ioctl(FAR struct file *filep, int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct file_operations g_motorops =
{
  motor_open,  /* open */
  motor_close, /* close */
  motor_read,  /* read */
  motor_write, /* write */
  NULL,        /* seek */
  motor_ioctl, /* ioctl */
  NULL         /* poll */
#ifndef CONFIG_DISABLE_PSEUDOFS_OPERATIONS
  , NULL      /* unlink */
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/************************************************************************************
 * Name: motor_open
 *
 * Description:
 *   This function is called whenever the motor device is opened.
 *
 ************************************************************************************/

static int motor_open(FAR struct file *filep)
{
  UNUSED(filep);
  return OK;
}

/************************************************************************************
 * Name: motor_close
 *
 * Description:
 *   This function is called when the motor device is closed.
 *
 ************************************************************************************/

static int motor_close(FAR struct file *filep)
{
  UNUSED(filep);
  return OK;
}

/************************************************************************************
 * Name: motor_read
 *
 * Description:
 *   Read rough motor status. The returned data is a byte, which each bit represents
 *   occurence of any error of each motor (LSB represents motor0). 0 means the 
 *   particular motor is normal (i.e., ready for operation). The MSB (i.e.bit8 
 *   represent the emergency status)
 *
 ************************************************************************************/

static ssize_t motor_read(FAR struct file *filep, FAR char *buffer, size_t buflen)
{
  uint8_t v;
  UNUSED(filep);
  UNUSED(buflen);

  if(motor_priv[0].state != MOTOR_READY)
    v = 1;
  else
    v = 0;

  for(int i=1;i <= 5;i++)
  {
    v <<= 1;
    if(motor_priv[i].state != MOTOR_READY)
    {
      v |= 1;
    }
  }

  if(motor_emergency_stat())
    v |= 0x80;

  *buffer = (char)v;

  return 1;
}

/************************************************************************************
 * Name: motor_write
 *
 * Description:
 *   A dummy write method.  This is provided only to satsify the VFS layer.
 *
 ************************************************************************************/

static ssize_t motor_write(FAR struct file *filep, FAR const char *buffer, size_t buflen)
{
  /* Return a failure */
  UNUSED(filep);
  UNUSED(buffer);
  UNUSED(buflen);

  return -EPERM;
}

/************************************************************************************
 * Name: motor_ioctl
 *
 * Description:
 *   The standard ioctl method.  This is where ALL of the motor work is done.
 *
 ************************************************************************************/

static int motor_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode          *inode = filep->f_inode;
  FAR struct motor_priv_s   *motor;
  int                        ret;
  uint32_t                   l;

  motor = inode->i_private;
  DEBUGASSERT(motor != NULL);
//  _info("cmd: %d arg: %ld\n", cmd, arg);

  /* Handle built-in ioctl commands */

  switch (cmd)
    {
      case MOTOR_CMD_INIT:
        ret = motor_enter_ready(motor);
        break;

      case MOTOR_CMD_SVOFF:
        //_info("MOTOR %u OFF\n", motor->cfg->motor_id);
        motor_servo_off(motor->cfg);
        ret = OK;
        break;

